# 3 Задание
n = input('Введите целое число:')
b = int(str(n + n))
c = int(str(n + n + n))
a = int(n)
s = a + b + c
print("Результат: ", a, '+', b, "+", c, '=', s)