# 1. Задание.
a = 67
b = 17
print(a, b, (a + b), (a - b), (a * b), (a / b))
print((a // b), (a % b))

name = input("Введите своё имя: ")
print("Добрый день, ", name)
a = int(input('Сколько Вам лет? '))
print("Вы родились в ", (2021 - a), 'году?')


