# Задание 2.
sec = int(input("Введите время в секундах: "))
h = sec // 3600
m = (sec - (h * 3600)) // 60
s = sec % 60

print("Ваши секунды составили чч:мм:сс :","%02d" % h,":", "%02d" % m,":", "%02d" % s)


